app/controllers/articles_controller.rb

	def create
	  @article = Article.new(article_params)

	  if @article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-11-11 13:55:45.929677"], ["text", "This is my first article"], ["title", "First Article"], ["updated_at", "2015-11-11 13:55:45.929677"]]

	def update
		@article = Article.find(params[:id])

		if @article.update(article_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "articles" SET "text" = ?, "title" = ?, "updated_at" = ? WHERE "articles"."id" = 3  [["text", "This is my first article."], ["title", "First Article!"], ["updated_at", "2015-11-12 04:44:42.845040"]]