app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["body", "Hehe"], ["commenter", "Me"], ["created_at", "2015-11-12 03:03:44.588291"], ["updated_at", "2015-11-12 03:03:44.588291"]]
---
	def create
		@article = Article.find(params[:article_id])
		@comment = @article.comments.create(comment_params)